config.org
#+TITLE: my emacs config
#+AUTHOR: jas jasovski
#+DESCRIPTION: this is my emacs configuration
#+STARTUP: overview
#+OPTIONS: toc:2

# A B C D E F G H I J K L M N O P Q R S T U V W X Y Z

* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#adding-the-scripts-directory-path][Adding the scripts directory path]]
  - [[#sourcing-the-scripts][Sourcing the scripts]]
- [[#all-the-icons][ALL THE ICONS]]
- [[#consult][CONSULT]]
- [[#corfu][CORFU]]
  - [[#nerd-icons-corfu][Nerd-icons-corfu]]
  - [[#corfu-terminal][Corfu terminal]]
- [[#cape][CAPE]]
- [[#dired][DIRED]]
- [[#doom-modeline][DOOM-MODELINE]]
- [[#dap][DAP]]
  - [[#dap-mode][DAP-MODE]]
- [[#dashboard][DASHBOARD]]
- [[#diminish][DIMINISH]]
- [[#ellama][ELLAMA]]
- [[#eglot][EGLOT]]
- [[#evil][EVIL]]
- [[#embark][EMBARK]]
  - [[#embark-consult][EMBARK-CONSULT]]
- [[#formatters][FORMATTERS]]
  - [[#elisp-autofmt][elisp-autofmt]]
- [[#flycheck][FLYCHECK]]
- [[#fonts][FONTS]]
  - [[#setting-the-font-face][setting the font face]]
  - [[#unicode-fonts][unicode fonts]]
  - [[#zooming-inout][zooming in/out]]
- [[#general][GENERAL]]
- [[#git][GIT]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
  - [[#git-gutter][Git gutter]]
- [[#gettings-things-done][GETTINGS THINGS DONE]]
  - [[#setting-the-directory][Setting the directory]]
  - [[#making-the-gtd-menu][Making the GTD menu]]
  - [[#capture-ideas][Capture ideas]]
- [[#graphical-user-interface-tweaks][GRAPHICAL USER INTERFACE TWEAKS]]
  - [[#disable-menubar-toolbars-and-scrollbars][Disable Menubar, Toolbars and Scrollbars]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
- [[#latex][LATEX]]
  - [[#modes][Modes]]
  - [[#auctex][AUCTeX]]
  - [[#pdf-viewer][PDF viewer]]
- [[#language-support][LANGUAGE SUPPORT]]
- [[#misc-testing][MISC TESTING]]
- [[#marginalia][MARGINALIA]]
- [[#modes-1][MODES]]
  - [[#automatically-turning-on-modes][Automatically turning on modes]]
- [[#neotree][NEOTREE]]
- [[#orderless][ORDERLESS]]
- [[#org-mode][ORG MODE]]
  - [[#disable--enable-features][Disable / enable features]]
  - [[#tempo][Tempo]]
  - [[#tempel][Tempel]]
  - [[#font-lock-keywords][Font lock keywords]]
  - [[#pomodor-in-org-clock][Pomodor in org clock]]
  - [[#org-back-links][Org back links]]
- [[#steam][STEAM]]
- [[#smartparens][SMARTPARENS]]
- [[#savehist][SAVEHIST]]
- [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][eshell]]
  - [[#vterm][vterm]]
  - [[#vterm-toggle][vterm toggle]]
  - [[#multivterm][multivterm]]
- [[#snippets][SNIPPETS]]
  - [[#yasnippet][Yasnippet]]
  - [[#yasnippet-snippets][Yasnippet-snippets]]
  - [[#yasnippet-capf][Yasnippet-capf]]
- [[#colorful-mode][COLORFUL-MODE]]
- [[#projectile][PROJECTILE]]
- [[#typit][TYPIT]]
- [[#transient][TRANSIENT]]
- [[#theme][THEME]]
- [[#undo][UNDO]]
  - [[#undo-limits][undo limits]]
  - [[#vundo][vundo]]
  - [[#undo-fu][undo-fu]]
  - [[#undo-fu-session][undo-fu session]]
- [[#vertico][VERTICO]]
  - [[#vertico-directory][Vertico directory]]
  - [[#vertico-1][Vertico]]
- [[#which-key][WHICH-KEY]]

* IMPORTANT PROGRAMS TO LOAD FIRST
** Adding the scripts directory path
#+begin_src emacs-lisp
(add-to-list 'load-path "/home/martin/.config/emacs/scripts/")
#+end_src

** Sourcing the scripts
#+begin_src emacs-lisp
(require 'elpaca-setup)  ;; The Elpaca Package Manager
(require 'buffer-move)   ;; Buffer-move for better window managment
#+end_src

* ALL THE ICONS
Note you have to run the *all-the-icons-install-fonts* command so it actually installs the fonts
#+begin_src emacs-lisp
(use-package all-the-icons :ensure t :if (display-graphic-p))

(use-package
 all-the-icons-dired
 :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

* CONSULT
#+begin_src emacs-lisp
(use-package consult)
#+end_src

* CORFU
COmpletion in Region FUnction. Corfu enhances in-buffer completion with a small completion popup. The current candidates are shown in a popup below or above the point, and can be selected by moving up and down. Corfu is the minimalistic in-buffer completion counterpart of the Vertico minibuffer UI.
#+begin_src emacs-lisp
(use-package
 corfu
 :ensure t
 :custom
 (corfu-cycle t) ;; allow cycling through candidates
 (corfu-auto t) ;; enable auto completion
 (corfu-auto-prefix 1) ;; minimum length for auto completion
 (corfu-auto-delay 0.0) ;; no delay might cause problems
 (corfu-popupinfo-delay '(0.5 . 0.2)) ;; vscode-like popups
 (corfu-echo-documentation t)
 (corfu-preselect 'prompt) ;; always preselect the prompt
 (corfu-on-exact-match nil) ;; Don't auto expand snippets
 :config
 (define-key corfu-map (kbd "C-k") (kbd "<up>"))
 (define-key corfu-map (kbd "C-j") (kbd "<down>"))
 ;; supertab-like behavior
 :bind (:map corfu-map
             ("M-SPC"      . corfu-insert-separator)
             ("TAB"        . corfu-next)
             ([tab]        . corfu-next)
             ("S-TAB"      . corfu-previous)
             ([backtab]    . corfu-previous)
             ("S-<return>" . corfu-insert)
             ("RET"        . corfu-insert))
 :init
 (global-corfu-mode)
 (corfu-history-mode)
 (corfu-popupinfo-mode))
#+end_src

** Nerd-icons-corfu
#+begin_src emacs-lisp
(use-package
 nerd-icons-corfu
 :config (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src 

** Corfu terminal
NOTE: Corfu relies on child frames to show the popup. Emacs 31 supports child frames also for terminal Emacs. On older Emacs versions, you can use the corfu-terminal package.
#+begin_src emacs-lisp
(use-package corfu-terminal)
#+end_src

* CAPE
#+begin_src emacs-lisp
(use-package
 cape
 :ensure t
 :defer 10
 :init
 (add-hook 'completion-at-point-functions #'cape-file) ;; you can complete files /bin/
 (add-hook 'completion-at-point-functions #'cape-dabbrev) ;; dabbrev pretty cool
 (add-hook 'completion-at-point-functions #'cape-dict) ;; dabbrev pretty cool
 (add-hook 'completion-at-point-functions #'yasnippet-capf) ;; yasnippets
 (add-hook 'completion-at-point-functions #'cape-elisp-block)

(defun my/eglot-capf ()
  (setq-local completion-at-point-functions
              (list (cape-capf-super
                     #'eglot-completion-at-point
                     #'yasnippet-capf))))
;; make functions by language so you can enable dabbrev for tex
;; make yasnippets load sepperately form everything else

(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
)

#+end_src

* DIRED
dired table with dired usage commands rename move delete eetc
r - redisplay
D - delete
#+begin_src emacs-lisp
(use-package dired-open-with :defer t :ensure t)
;;(defun dpautoload-function () (message "test")) the functions has to be actually defined fyi

(use-package
 dired-preview
 :ensure t
 :defer t
 :commands dired-preview-mode
 :init (add-hook 'dired-mode-hook 'dired-preview-mode)
 :config (setq dired-preview-delay 0.3)
 (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
 (evil-define-key 'normal dired-mode-map (kbd "l") (kbd "RET")))
#+end_src

