config.org
** Setting the directory
#+begin_src emacs-lisp
(require 'org)
;; defining the files org-mode will look at
(setq org-directory "~/Notes/GTD")
;; this does not add files to org-agenda use org-agenda-file-to-front, a fix is avilable this has to load after org-mode has loaded but i dont know the function that does that in non doom emacs
;; write a custom hook to load this after org-mode
(setq org-agenda-files (list "inbox.org" "projects.org" "agenda.org")) ;; this still doesnt work
;; this bit works no problem
(setq org-agenda-files
      (mapcar 'file-truename
          (file-expand-wildcards "*.org")))

;; Save the corresponding buffers
(defun gtd-save-org-buffers ()
  "Save `org-agenda-files' buffers without user confirmation.
See also `org-save-all-org-buffers'"
  (interactive)
  (message "Saving org-agenda-files buffers...")
  (save-some-buffers t (lambda () 
             (when (member (buffer-file-name) org-agenda-files) 
               t)))
  (message "Saving org-agenda-files buffers... done"))

;; Add it after refile
(advice-add 'org-refile :after
        (lambda (&rest _)
          (gtd-save-org-buffers)))

#+end_src

** Making the GTD menu
#+begin_src emacs-lisp
;; default agenda view 
(setq org-agenda-span 2)

;; variables for the command below
(setq gtd/next-action-head "Next action: ")
(setq gtd/deadline-head "Deadline: ")
(setq gtd/inbox-head "Inbox: ")
(setq gtd/complete-head "Completed items: ")
(setq gtd/project-head "Projects: ")
(setq gtd/someday-head "Someday/maybe: ")

;; gtd view this is a custom agenda command its binded to the g key
(setq org-agenda-custom-commands
      '(
        ("g" "GTD view"
         ((agenda)
          (tags-todo "+PRIORITY=\"A\"" ((org-agenda-overriding-header gtd/next-action-head)))
          (search "DEADLINE" ((org-agenda-overriding-header gtd/deadline-head)))
          ;;(search "SCHEDULE" ((org-agenda-overriding-header gtd/deadline-head)))
          (todo "COMPLETE" ((org-agenda-overriding-header gtd/complete-head)))
          (todo "TODO" ((org-agenda-overriding-header gtd/inbox-head)))
          (todo "PROJECT" ((org-agenda-overriding-header gtd/project-head)))
          (todo "HOLD"  ((org-agenda-overriding-header gtd/someday-head)))
          ))))
#+end_src

** Capture ideas
#+begin_src emacs-lisp
;; Capture templates to capture ideas into the inbox thing
(setq org-capture-templates
      `(("i" "Inbox" entry  (file "inbox.org")
         ,(concat "* TODO %?\n" ;; add a \n here so theres an empty line before it
                  "/Entered on/ %U"))
        ("p" "Project" entry  (file "projects.org")
         ,(concat "* PROJECT %?\n"
                  "/Entered on/ %U\n"
                  "** Description \n"
                  "** Concept images \n"
                  "** Notes \n"
                  "** Tasks \n"))
        ("d" "Deadline" entry  (file "inbox.org")
         ,(concat "* DEADLINE /Due on/ %? <%<%Y-%m-%d %a %H:00>> \n"))
        ("r" "Recurrent" entry  (file+headline "agenda.org" "Recurrent")
         ,(concat "* Reccurent event <timestamp 18:00-19:30>%?\n"
                  "SCHEDULED: <or date <2025-01-21 Tue> +/-/1y/m/w/d/h> \n"
                  "or work days SCHEDULED: <add2percentsignshere(memq (calendar-day-of-week date) '(1 2 3 4 5))>"))
        ("m" "Meeting" entry  (file+headline "agenda.org" "Future")
         ,(concat "* %? :meeting:\n"
                  "<%<%Y-%m-%d %a %H:00>>"))))

;; Use full window for org-capture
(add-hook 'org-capture-mode-hook 'delete-other-windows)

;; tags r redundent so we r hiddin em
(setq org-agenda-hide-tags-regexp ".")

;; gets rid of the category display for to do items
(setq org-agenda-prefix-format
      '((agenda . " ")
        (todo   . " ") ;; display the deadline date and schedule date too see the dashboard menu for that too
        (tags   . " ")
        (search . " %(let ((scheduled (org-get-deadline-time (point)))) (if scheduled (format-time-string \"%Y-%m-%d\" scheduled) \"\")) ")))

;; Refile
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
;;(setq org-refile-targets
;;      '(("projects.org" :regexp . "\\(?:\\(?:Note\\|Task\\)s\\)"))) ;; "Note" and "Task"s specify the heading
(setq org-refile-targets
      '(("projects.org" :maxlevel . 1)
        ("inbox.org" :maxlevel . 1)))

;; todo keywords
(setq org-todo-keywords
      '((sequence "TODO(t)" "HOLD(h)" "PROJECT(p)" "|" "COMPLETE(c)")))
#+end_src

* GRAPHICAL USER INTERFACE TWEAKS
** Disable Menubar, Toolbars and Scrollbars
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
(global-visual-line-mode t)
#+end_src

* LATEX
NOT CONFIGURED
** Modes
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook 'lsp)
(setq TeX-parse-self t)
;;(add-to-list 'auto-mode-alist '("\\.tex\\'" . 'lsp))
#+end_src

** AUCTeX
#+begin_src emacs-lisp
;;(use-package auctex)
#+end_src

** PDF viewer
theres probably a better way to do this
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . doc-view-mode))
#+end_src

* LANGUAGE SUPPORT
Emacs has built-in programming language modes for Lisp, Scheme, DSSSL, Ada, ASM, AWK, C, C++, Fortran, Icon, IDL (CORBA), IDLWAVE, Java, Javascript, M4, Makefiles, Metafont, Modula2, Object Pascal, Objective-C, Octave, Pascal, Perl, Pike, PostScript, Prolog, Python, Ruby, Simula, SQL, Tcl, Verilog, and VHDL. Other languages will require you to install additional modes.
#+begin_src emacs-lisp
;;(use-package lua-mode)
;;(use-package haskell-mode)
#+end_src

* MISC TESTING
#+begin_src emacs-lisp
;;(use-package nyan-mode)
#+end_src

* MARGINALIA
#+begin_src emacs-lisp
(use-package marginalia :ensure t :config (marginalia-mode))
#+end_src

* MODES
** Automatically turning on modes
*** Major modes
#+begin_src emacs-lisp
;;(add-to-list 'auto-mode-alist '("\\.org\\'" . org-display-inline-images))
#+end_src

*** Minor modes
#+begin_src emacs-lisp
(add-hook 'c++-mode-hook #'(lambda () (hs-minor-mode 1)))
(add-hook 'c-mode-hook #'(lambda () (hs-minor-mode 1)))
#+end_src

* NEOTREE
Neotree is a file tree viewer.  When you open neotree, it jumps to the current file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the neotree width be adjustable.  NeoTree provides following themes: classic, ascii, arrow, icons, and nerd.  Theme can be config'd by setting "two" themes for neo-theme: one for the GUI and one for the terminal.  I like to use 'SPC t' for 'toggle' keybindings, so I have used 'SPC t n' for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |
C-c options

neotree file manipulation commands here


#+begin_src emacs-lisp
(use-package neotree
  :config
  (setq neo-smart-open t
        neo-theme "ascii"
        neo-show-hidden-files t
        neo-window-width 28
        neo-window-fixed-size nil
        inhibit-compacting-font-caches t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))
#+end_src

* ORDERLESS
Emacs completion style that matches multiple regexps in any order.
#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

* ORG MODE
** Disable / enable features
*** Enabling Table of Contents
#+begin_src emacs-lisp
(use-package
 toc-org
 :commands toc-org-enable
 :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Enabling Org Bullets
Org-bullets gives us attractive bullets rather than asterisks.
#+begin_src emacs-lisp
(use-package
 org-bullets
 :config
 (add-hook 'org-mode-hook 'org-indent-mode)
 (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

*** Enabling Inline images
#+begin_src emacs-lisp
(setq org-startup-with-inline-images t)
(setq org-image-actual-width nil)
#+end_src

*** Disable electric indent
#+begin_src emacs-lisp
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

*** Hide emphasis marks
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

