config.org
** Tempo
This enables <q and <s behavior for blocks, org-tempo is not a separate package but a module within org that can be enabled.

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+begin_src emacs-lisp
(require 'tempo)
#+end_src

** Tempel
** Font lock keywords
#+begin_src emacs-lisp
(font-lock-add-keywords
 'org-mode
 '(("^ *\\([-]\\) " (0 (prog1 ()
         (compose-region (match-beginning 1) (match-end 1) "•"))))))
;; add X emoji for - [X] yada yada
#+end_src

** Pomodor in org clock
#+begin_src emacs-lisp
(setq org-clock-sound "~/.config/emacs/sounds/Bicycle-bell-2.wav")
(setq org-timer-default-timer 25)
#+end_src

** Org back links
#+begin_src emacs-lisp
;;(use-package org-backlink :ensure (:host github :repo "codecoll/org-backlink"))
#+end_src

* STEAM
#+begin_src emacs-lisp
(use-package steam :defer t :config (setq steam-username "Majmudonche"))
#+end_src

* SMARTPARENS
#+begin_src emacs-lisp
(use-package
 smartparens
 :ensure t
 :defer t
 :hook (prog-mode eglot org-mode latex-mode)
 :config (require 'smartparens-config))
#+end_src

* SAVEHIST
#+begin_src emacs-lisp
;;(use-package savehist :init (savehist-mode))
(savehist-mode)
#+end_src

* SHELLS AND TERMINALS
CONFIGURED I THINK
** eshell
eshell is an emacs 'shell' written in elisp
#+begin_src emacs-lisp
(use-package
 eshell-syntax-highlighting
 :after esh-mode
 :config (eshell-syntax-highlighting-global-mode +1))

;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
;; eshell-aliases-file -- sets an aliases file for the eshell.

(setq
 eshell-rc-script (concat user-emacs-directory "eshell/profile")
 eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
 eshell-history-size 5000
 eshell-buffer-maximum-lines 5000
 eshell-hist-ignoredups t
 eshell-scroll-to-bottom-on-input t
 eshell-destroy-buffer-when-process-dies t
 eshell-visual-commands' ("bash" "fish" "htop" "ssh" "top" "zsh"))
#+end_src

** vterm
#+begin_src emacs-lisp
(use-package
 vterm
 :config
 (setq
  vterm-shell "/bin/zsh"
  vterm-max-scrollback 5000))
#+end_src

** vterm toggle
#+begin_src emacs-lisp
(use-package
 vterm-toggle
 :after vterm
 :config
 (setq vterm-toggle-fullscreen-p nil)
 (setq vterm-toggle-scope 'project)
 (add-to-list
  'display-buffer-alist
  '((lambda (buffer-or-name _)
      (let ((buffer (get-buffer buffer-or-name)))
        (with-current-buffer buffer
          (or (equal major-mode 'vterm-mode)
              (string-prefix-p
               vterm-buffer-name (buffer-name buffer))))))
    (display-buffer-reuse-window display-buffer-at-bottom)
    ;;(display-buffer-reuse-window display-buffer-in-direction)
    ;;display-buffer-in-direction/direction/dedicated is added in emacs27
    ;;(direction . bottom)
    ;;(dedicated . t) ;dedicated is supported in emacs27
    (reusable-frames . visible) (window-height . 0.3))))
#+end_src
** multivterm
#+begin_src emacs-lisp
(use-package multi-vterm
	:config
	(add-hook 'vterm-mode-hook
			(lambda ()
			(setq-local evil-insert-state-cursor 'box)
			(evil-insert-state)))
	(define-key vterm-mode-map [return]                      #'vterm-send-return)

	(setq vterm-keymap-exceptions nil)
	(evil-define-key 'insert vterm-mode-map (kbd "C-e")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-f")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-a")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-v")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-b")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-w")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-u")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-n")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-m")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-p")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-j")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-k")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-r")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-t")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-g")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-c")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-SPC")    #'vterm--self-insert)
	(evil-define-key 'normal vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
	(evil-define-key 'normal vterm-mode-map (kbd ",c")       #'multi-vterm)
	(evil-define-key 'normal vterm-mode-map (kbd ",n")       #'multi-vterm-next)
	(evil-define-key 'normal vterm-mode-map (kbd ",p")       #'multi-vterm-prev)
	(evil-define-key 'normal vterm-mode-map (kbd "i")        #'evil-insert-resume)
	(evil-define-key 'normal vterm-mode-map (kbd "o")        #'evil-insert-resume)
	(evil-define-key 'normal vterm-mode-map (kbd "<return>") #'evil-insert-resume))
#+end_src

* SNIPPETS
NOT CONFIGURED
** Yasnippet
#+begin_src emacs-lisp
(use-package
 yasnippet
 :config
 ;;(setq yas-snippet-dirs '("~/.config/emacs/snippets" "~/.config/emacs/elpaca/repos/yasnippet-snippets/snippets/"))
 (yas-global-mode 1))
#+end_src

** Yasnippet-snippets
#+begin_src emacs-lisp
(use-package yasnippet-snippets
  :ensure t
  :hook
  (prog-mode . yas-minor-mode)
  :bind
  (("C-c y n" . yas-new-snippet)
   ("C-c y v" . yas-visit-snippet-file)
   ("C-c y i" . yas-insert-snippet))
  :config
  (yas-reload-all))
#+end_src

** Yasnippet-capf
#+begin_src emacs-lisp
(use-package yasnippet-capf
  :after cape
  :config
(setq yasnippet-capf-lookup-by 'name) ;; Prefer the name of the snippet instead
)
#+end_src

* COLORFUL-MODE
Preview any color in the buffer.
#+begin_src emacs-lisp
(use-package colorful-mode
 :ensure t
 :defer t
 :diminish
 :hook ((org-mode prog-mode) . colorful-mode))
#+end_src

* PROJECTILE
Projectile is a project interaction library for emacs

+----------------------+---------------------------+-------------------+
| COMMAND              | DESCRIPTION               | KEYBINDING        |
+----------------------+---------------------------+-------------------+
| projectile-find-file | /Find a file in a project/  | SPC p f           |
+-----------------------------+--------+--------+
| projectile-switch-to-buffer | /Switch to a different project buffer/        | SPC p b       |
+--------+--------+--------+
| grep search in project       |        |        |
+--------+--------+--------+
| kill close project buffers       |        |        |
+--------+--------+--------+
| recent files in project        |        |        |
+--------+--------+--------+
|         |        |        |
+--------+--------+--------+
|        |        |        |
+--------+--------+--------+
|        |        |        |
+--------+--------+--------+
|        |        |        |
+--------+--------+--------+


#+begin_src emacs-lisp
(use-package ripgrep)
(use-package
 projectile
 :config
 (projectile-mode 1))
#+end_src

* TYPIT
#+begin_src emacs-lisp
(use-package typit :defer t)
#+end_src

* TRANSIENT
Transient is a library used to implement the keyboard-driven “menus” in Magit. The bundled version is very old and doesn't work with Magit.
#+begin_src emacs-lisp
(use-package transient)
#+end_src

* THEME
# done
Zenburn is a low-contrast color scheme.
#+begin_src emacs-lisp
(use-package zenburn-theme :init (load-theme 'zenburn t))
#+end_src

* UNDO
# done
Undo related configuration, includes plugins and default variables.
** undo limits
Here we set the default emacs undo limits.
#+begin_src emacs-lisp
(setq undo-limit 67108864) ;; 64mb.
(setq undo-strong-limit 100663296) ;; 96mb.
(setq undo-outer-limit 134217728) ;; 128mb.
#+end_src

** vundo
Visualize the undo tree.
#+begin_src emacs-lisp
(use-package
 vundo
 :config (setq vundo-glyph-alist vundo-unicode-symbols) (setq vundo-window-side 'top))
#+end_src

** undo-fu
Undo helper with redo.
#+begin_src emacs-lisp
(use-package undo-fu)
#+end_src

** undo-fu session
Save and recover undo steps between emacs sessions>
#+begin_src emacs-lisp
(use-package undo-fu-session
  :config
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  (setq undo-fu-session-directory "~/.cache/undo-fu-session/")
  (undo-fu-session-global-mode))
#+end_src

* VERTICO
# done
VERTical Interactive COmpletion.
#+begin_src emacs-lisp
(use-package
 vertico
 :ensure t
 :custom 
 (vertico-count 9)
 :init (vertico-mode)
 :config
 (define-key vertico-map (kbd "C-k") (kbd "<up>"))
 (define-key vertico-map (kbd "C-j") (kbd "<down>")))
#+end_src

